# FormulaManager Properties

---
The FormulaManager type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
FormulaManager Class
Autodesk.Revit.DB Namespace